# CurveElementType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveElementFilter..::..CurveElementType Property
CurveElementFilter Class See Also
---
The curve element type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public CurveElementType CurveElementType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurveElementType As CurveElementType
	Get
```

Visual C++
---
```text
public:
property CurveElementType CurveElementType {
	CurveElementType get ();
}
```

# See Also
CurveElementFilter Class
Autodesk.Revit.DB Namespace